In [144]:
import pandas as pd

df_job_company = pd.read_csv(r"C:\Users\rcrds\Desktop\Ironhack\Projects\Jobs SQL\sql-database\data\clean\To merge\Dataset1_Clean_Project4_GrpB_final.csv", sep=',')

df_job_company = df_job_company.drop(columns=["Rating","same_state","age","python_yn","R_yn","spark","aws","excel","Competitors","hourly","employer_provided","min_salary","max_salary","Salary Estimate","Company Name"])
df_job_company

,Job Title,Job Description,Location,Headquarters,Size,Founded,Type of ownership,Industry,Sector,Revenue,avg_salary,company_txt,job_state
0,Data Scientist,"Data Scientist\r\nLocation: Albuquerque, NM\r\...","Albuquerque, NM","Goleta, CA",501 to 1000 employees,1973,Company - Private,Aerospace & Defense,Aerospace & Defense,$50 to $100 million (USD),720,Tecolote Research\r\n,NM
1,Healthcare Data Scientist,What You Will Do:\r\n\r\nI. General Summary\r\...,"Linthicum, MD","Baltimore, MD",10000+ employees,1984,Other Organization,Health Care Services & Hospitals,Health Care,$2 to $5 billion (USD),875,University of Maryland Medical System\r\n,MD
2,Data Scientist,"KnowBe4, Inc. is a high growth information sec...","Clearwater, FL","Clearwater, FL",501 to 1000 employees,2010,Company - Private,Security Services,Business Services,$100 to $500 million (USD),850,KnowBe4\r\n,FL
3,Data Scientist,*Organization and Job ID**\r\nJob ID: 310709\r...,"Richland, WA","Richland, WA",1001 to 5000 employees,1965,Government,Energy,"Oil, Gas, Energy & Utilities",$500 million to $1 billion (USD),765,PNNL\r\n,WA
4,Data Scientist,Data Scientist\r\nAffinity Solutions / Marketi...,"New York, NY","New York, NY",51 to 200 employees,1998,Company - Private,Advertising & Marketing,Business Services,Unknown / Non-Applicable,1145,Affinity Solutions\r\n,NY
...,...,...,...,...,...,...,...,...,...,...,...,...,...
737,"Sr Scientist, Immuno-Oncology - Oncology",Site Name: USA - Massachusetts - Cambridge\r\n...,"Cambridge, MA","Brentford, United Kingdom",10000+ employees,1830,Company - Public,Biotech & Pharmaceuticals,Biotech & Pharmaceuticals,$10+ billion (USD),845,GSK\r\n,MA
738,Senior Data Engineer,THE CHALLENGE\r\nEventbrite has a world-class ...,"Nashville, TN","San Francisco, CA",1001 to 5000 employees,2006,Company - Public,Internet,Information Technology,$100 to $500 million (USD),1025,Eventbrite\r\n,TN
739,"Project Scientist - Auton Lab, Robotics Institute",The Auton Lab at Carnegie Mellon University is...,"Pittsburgh, PA","Pittsburgh, PA",501 to 1000 employees,1984,College / University,Colleges & Universities,Education,Unknown / Non-Applicable,735,Software Engineering Institute\r\n,PA
740,Data Science Manager,Data Science ManagerResponsibilities:\r\n\r\nO...,"Allentown, PA","Chadds Ford, PA",1 to 50 employees,-1,Company - Private,Staffing & Outsourcing,Business Services,$5 to $10 million (USD),1275,"Numeric, LLC\r\n",PA
741,Research Scientist – Security and Privacy,Returning Candidate? Log back in to the Career...,"Beavercreek, OH","Arlington, VA",501 to 1000 employees,1967,Nonprofit Organization,Federal Agencies,Government,$50 to $100 million (USD),935,Riverside Research Institute\r\n,OH

In [202]:
import re
df_job = df_job_company[["Job Title","Job Description","Location","avg_salary","job_state","company_txt"]]
df_job["Job Description"] = df_job["Job Description"].str.replace("\r\n","").str.replace("€™","").str.replace("â€","")
df_job = df_job.reset_index()
df_job = df_job.rename(columns={"index":"job_ID",
                                "Job Title":"title",
                                "Job Description":"description",
                                "avg_salary":"salary",
                                "job_state":"state",
                                "Location":"location"
                                })
def clean_for_mysql(text):
    if pd.isna(text):
        return text

    text = str(text)

    # 1. Remove ALL control characters (0x00–0x1F and 0x7F)
    text = re.sub(r"[\x00-\x1F\x7F]", " ", text)

    # 2. Normalize whitespace
    text = re.sub(r"\s+", " ", text)

    return text.strip()

df_job["description"] = df_job["description"].apply(clean_for_mysql)
df_job = df_job.rename(columns= {"company_txt":"Company Name"})
df_job["Company Name"] = df_job["Company Name"].str.replace("\r\n","")

C:\Users\rcrds\AppData\Local\Temp\ipykernel_30444\3682450429.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_job["Job Description"] = df_job["Job Description"].str.replace("\r\n","").str.replace("€™","").str.replace("â€","")

In [203]:
df_job

,job_ID,title,description,location,salary,state,Company Name
0,0,Data Scientist,"Data ScientistLocation: Albuquerque, NMEducati...","Albuquerque, NM",720,NM,Tecolote Research
1,1,Healthcare Data Scientist,What You Will Do:I. General SummaryThe Healthc...,"Linthicum, MD",875,MD,University of Maryland Medical System
2,2,Data Scientist,"KnowBe4, Inc. is a high growth information sec...","Clearwater, FL",850,FL,KnowBe4
3,3,Data Scientist,*Organization and Job ID**Job ID: 310709Direct...,"Richland, WA",765,WA,PNNL
4,4,Data Scientist,Data ScientistAffinity Solutions / Marketing C...,"New York, NY",1145,NY,Affinity Solutions
...,...,...,...,...,...,...,...
737,737,"Sr Scientist, Immuno-Oncology - Oncology",Site Name: USA - Massachusetts - CambridgePost...,"Cambridge, MA",845,MA,GSK
738,738,Senior Data Engineer,THE CHALLENGEEventbrite has a world-class data...,"Nashville, TN",1025,TN,Eventbrite
739,739,"Project Scientist - Auton Lab, Robotics Institute",The Auton Lab at Carnegie Mellon University is...,"Pittsburgh, PA",735,PA,Software Engineering Institute
740,740,Data Science Manager,Data Science ManagerResponsibilities:Oversee a...,"Allentown, PA",1275,PA,"Numeric, LLC"
741,741,Research Scientist – Security and Privacy,Returning Candidate? Log back in to the Career...,"Beavercreek, OH",935,OH,Riverside Research Institute

In [147]:
df_job["salary"] = df_job["salary"]/10

In [148]:
#df_job.to_excel(r"C:\Users\rcrds\Downloads\TABLE_JOB5.xlsx",index=False)

In [149]:
df_job.to_csv(
    "JOBS_TABLE_FINAL.csv",
    index=False,
    encoding="utf-8",
    sep=",",
    quoting=1,        # QUOTE_ALL
    escapechar="\\"
)

In [150]:
df_job_company

,Job Title,Job Description,Location,Headquarters,Size,Founded,Type of ownership,Industry,Sector,Revenue,avg_salary,company_txt,job_state
0,Data Scientist,"Data Scientist\r\nLocation: Albuquerque, NM\r\...","Albuquerque, NM","Goleta, CA",501 to 1000 employees,1973,Company - Private,Aerospace & Defense,Aerospace & Defense,$50 to $100 million (USD),720,Tecolote Research\r\n,NM
1,Healthcare Data Scientist,What You Will Do:\r\n\r\nI. General Summary\r\...,"Linthicum, MD","Baltimore, MD",10000+ employees,1984,Other Organization,Health Care Services & Hospitals,Health Care,$2 to $5 billion (USD),875,University of Maryland Medical System\r\n,MD
2,Data Scientist,"KnowBe4, Inc. is a high growth information sec...","Clearwater, FL","Clearwater, FL",501 to 1000 employees,2010,Company - Private,Security Services,Business Services,$100 to $500 million (USD),850,KnowBe4\r\n,FL
3,Data Scientist,*Organization and Job ID**\r\nJob ID: 310709\r...,"Richland, WA","Richland, WA",1001 to 5000 employees,1965,Government,Energy,"Oil, Gas, Energy & Utilities",$500 million to $1 billion (USD),765,PNNL\r\n,WA
4,Data Scientist,Data Scientist\r\nAffinity Solutions / Marketi...,"New York, NY","New York, NY",51 to 200 employees,1998,Company - Private,Advertising & Marketing,Business Services,Unknown / Non-Applicable,1145,Affinity Solutions\r\n,NY
...,...,...,...,...,...,...,...,...,...,...,...,...,...
737,"Sr Scientist, Immuno-Oncology - Oncology",Site Name: USA - Massachusetts - Cambridge\r\n...,"Cambridge, MA","Brentford, United Kingdom",10000+ employees,1830,Company - Public,Biotech & Pharmaceuticals,Biotech & Pharmaceuticals,$10+ billion (USD),845,GSK\r\n,MA
738,Senior Data Engineer,THE CHALLENGE\r\nEventbrite has a world-class ...,"Nashville, TN","San Francisco, CA",1001 to 5000 employees,2006,Company - Public,Internet,Information Technology,$100 to $500 million (USD),1025,Eventbrite\r\n,TN
739,"Project Scientist - Auton Lab, Robotics Institute",The Auton Lab at Carnegie Mellon University is...,"Pittsburgh, PA","Pittsburgh, PA",501 to 1000 employees,1984,College / University,Colleges & Universities,Education,Unknown / Non-Applicable,735,Software Engineering Institute\r\n,PA
740,Data Science Manager,Data Science ManagerResponsibilities:\r\n\r\nO...,"Allentown, PA","Chadds Ford, PA",1 to 50 employees,-1,Company - Private,Staffing & Outsourcing,Business Services,$5 to $10 million (USD),1275,"Numeric, LLC\r\n",PA
741,Research Scientist – Security and Privacy,Returning Candidate? Log back in to the Career...,"Beavercreek, OH","Arlington, VA",501 to 1000 employees,1967,Nonprofit Organization,Federal Agencies,Government,$50 to $100 million (USD),935,Riverside Research Institute\r\n,OH

In [151]:
df_company = df_job_company[["Headquarters","Size","Founded","Type of ownership","Industry","Sector","Revenue","company_txt"]]
df_company = df_company.rename(columns= {"company_txt":"Company Name"})
df_company["Company Name"] = df_company["Company Name"].str.replace("\r\n","")
df_company = df_company.rename(columns={"Headquarters":"headquarters",
                           "Size":"size",
                           "Founded":"year_founded",
                           "Type of ownership":"ownership_type",
                           "Industry":"industry",
                           "Sector":"sector",
                           "Revenue":"revenue",
                           "Company Name":"name"})
df_company["year_founded"] = df_company["year_founded"].astype(int)
df_company

,headquarters,size,year_founded,ownership_type,industry,sector,revenue,name
0,"Goleta, CA",501 to 1000 employees,1973,Company - Private,Aerospace & Defense,Aerospace & Defense,$50 to $100 million (USD),Tecolote Research
1,"Baltimore, MD",10000+ employees,1984,Other Organization,Health Care Services & Hospitals,Health Care,$2 to $5 billion (USD),University of Maryland Medical System
2,"Clearwater, FL",501 to 1000 employees,2010,Company - Private,Security Services,Business Services,$100 to $500 million (USD),KnowBe4
3,"Richland, WA",1001 to 5000 employees,1965,Government,Energy,"Oil, Gas, Energy & Utilities",$500 million to $1 billion (USD),PNNL
4,"New York, NY",51 to 200 employees,1998,Company - Private,Advertising & Marketing,Business Services,Unknown / Non-Applicable,Affinity Solutions
...,...,...,...,...,...,...,...,...
737,"Brentford, United Kingdom",10000+ employees,1830,Company - Public,Biotech & Pharmaceuticals,Biotech & Pharmaceuticals,$10+ billion (USD),GSK
738,"San Francisco, CA",1001 to 5000 employees,2006,Company - Public,Internet,Information Technology,$100 to $500 million (USD),Eventbrite
739,"Pittsburgh, PA",501 to 1000 employees,1984,College / University,Colleges & Universities,Education,Unknown / Non-Applicable,Software Engineering Institute
740,"Chadds Ford, PA",1 to 50 employees,-1,Company - Private,Staffing & Outsourcing,Business Services,$5 to $10 million (USD),"Numeric, LLC"
741,"Arlington, VA",501 to 1000 employees,1967,Nonprofit Organization,Federal Agencies,Government,$50 to $100 million (USD),Riverside Research Institute

In [152]:
df_isin = pd.read_csv(r"C:\Users\rcrds\Desktop\Ironhack\Projects\Jobs SQL\sql-database\data\clean\glassdoor_reviews\companiesISIN.csv")
df_isin = df_isin.drop_duplicates(subset="Company Name", keep="first")
df_isin.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2412 entries, 0 to 2464
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Company ISIN  2412 non-null   object
 1   Company Name  2412 non-null   object
dtypes: object(2)
memory usage: 56.5+ KB

In [153]:
df_rating = pd.read_csv(r"C:\Users\rcrds\Desktop\Ironhack\Projects\Jobs SQL\sql-database\data\clean\To merge\Rating_Id.csv").drop_duplicates()
df_rating

,rating_id,company_isin,business_outlook_rating,ceo_rating,compensation_benefits_rating,culture_values_rating,diversity_inclusion_rating,number_of_reviews,overall_rating,recommend_friend_rating,senior_management_rating
0,1,AEA000801018,0.583333,0.500000,3.227273,3.476190,3.818182,28,3.392857,0.750000,3.142857
1,2,AEA002001013,0.666667,NaN,3.333333,3.333333,3.583333,13,3.000000,0.500000,2.583333
2,3,AEA006101017,0.750000,0.500000,3.750000,3.666667,2.666667,10,3.300000,0.800000,3.333333
3,4,AEA007301012,0.963415,0.975309,4.105769,4.039216,4.019417,132,4.136364,0.884211,3.960784
4,5,AED000201015,0.894737,0.750000,3.791667,3.333333,3.541667,35,3.600000,0.695652,3.333333
...,...,...,...,...,...,...,...,...,...,...,...
2136,2137,ZAE000255360,0.808000,0.821782,3.400000,3.633929,4.009091,268,3.645522,0.722222,3.334862
2137,2138,ZAE000255915,0.883929,0.819048,3.782857,3.811429,3.852941,233,3.939914,0.780142,3.470930
2138,2139,ZAE000259479,0.714286,NaN,3.333333,3.866667,3.266667,17,3.764706,0.714286,3.200000
2139,2140,ZAE000314084,0.848485,0.500000,3.846154,3.905660,3.980000,71,3.704225,0.680000,3.226415
2140,2141,ZAE000325783,1.000000,1.000000,5.000000,5.000000,5.000000,1,5.000000,1.000000,5.000000

In [154]:
df_rating2 = pd.merge(df_rating, df_isin, how="left", left_on="company_isin", right_on="Company ISIN").drop(columns="Company ISIN")
df_rating2

,rating_id,company_isin,business_outlook_rating,ceo_rating,compensation_benefits_rating,culture_values_rating,diversity_inclusion_rating,number_of_reviews,overall_rating,recommend_friend_rating,senior_management_rating,Company Name
0,1,AEA000801018,0.583333,0.500000,3.227273,3.476190,3.818182,28,3.392857,0.750000,3.142857,Abu Dhabi Islamic Bank
1,2,AEA002001013,0.666667,NaN,3.333333,3.333333,3.583333,13,3.000000,0.500000,2.583333,Aldar Holding
2,3,AEA006101017,0.750000,0.500000,3.750000,3.666667,2.666667,10,3.300000,0.800000,3.333333,ADCO
3,4,AEA007301012,0.963415,0.975309,4.105769,4.039216,4.019417,132,4.136364,0.884211,3.960784,ADNOC Group
4,5,AED000201015,0.894737,0.750000,3.791667,3.333333,3.541667,35,3.600000,0.695652,3.333333,Dubai Islamic Bank
...,...,...,...,...,...,...,...,...,...,...,...,...
2136,2137,ZAE000255360,0.808000,0.821782,3.400000,3.633929,4.009091,268,3.645522,0.722222,3.334862,Old Mutual
2137,2138,ZAE000255915,0.883929,0.819048,3.782857,3.811429,3.852941,233,3.939914,0.780142,3.470930,Absa
2138,2139,ZAE000259479,0.714286,NaN,3.333333,3.866667,3.266667,17,3.764706,0.714286,3.200000,Pepkor
2139,2140,ZAE000314084,0.848485,0.500000,3.846154,3.905660,3.980000,71,3.704225,0.680000,3.226415,Outsurance
2140,2141,ZAE000325783,1.000000,1.000000,5.000000,5.000000,5.000000,1,5.000000,1.000000,5.000000,Naspers

In [155]:
business_outlook_rating_avg = df_rating2["business_outlook_rating"].mean()
df_rating2["business_outlook_rating"] = df_rating2["business_outlook_rating"].fillna(business_outlook_rating_avg)

In [156]:

ceo_rating_avg = df_rating2["ceo_rating"].mean()
df_rating2["ceo_rating"] = round(df_rating2["ceo_rating"].fillna(ceo_rating_avg),2)

compensation_benefits_rating_avg = df_rating2["compensation_benefits_rating"].mean()
df_rating2["compensation_benefits_rating"] = round(df_rating2["compensation_benefits_rating"].fillna(compensation_benefits_rating_avg),2)

culture_values_rating_avg = df_rating2["culture_values_rating"].mean()
df_rating2["culture_values_rating"] = round(df_rating2["culture_values_rating"].fillna(culture_values_rating_avg),2)

diversity_inclusion_rating_avg = df_rating2["diversity_inclusion_rating"].mean()
df_rating2["diversity_inclusion_rating"] = round(df_rating2["diversity_inclusion_rating"].fillna(diversity_inclusion_rating_avg),2)

recommend_friend_rating_avg = df_rating2["recommend_friend_rating"].mean()
df_rating2["recommend_friend_rating"] = round(df_rating2["recommend_friend_rating"].fillna(recommend_friend_rating_avg),2)

senior_management_rating_avg = df_rating2["senior_management_rating"].mean()
df_rating2["senior_management_rating"] = round(df_rating2["senior_management_rating"].fillna(senior_management_rating_avg),2)
df_rating2["overall_rating"] = round(df_rating2["overall_rating"],2)
df_rating2["business_outlook_rating"] = round(df_rating2["business_outlook_rating"],2)
df_rating2.isnull().sum()

rating_id                        0
company_isin                     0
business_outlook_rating          0
ceo_rating                       0
compensation_benefits_rating     0
culture_values_rating            0
diversity_inclusion_rating       0
number_of_reviews                0
overall_rating                   0
recommend_friend_rating          0
senior_management_rating         0
Company Name                    52
dtype: int64

In [157]:
df_rating2 = df_rating2.rename(columns={"company_isin":"company_ISIN",
                           "business_outlook_rating":"business_outlook",
                           "ceo_rating":"ceo",
                           "compensation_benefits_rating":"compensation_benefits",
                           "culture_values_rating":"culture_values",
                           "diversity_inclusion_rating":"diversity_inclusion",
                           "number_of_reviews":"review_number",
                           "overall_rating":"overall",
                           "recommend_friend_rating":"recommend_friend",
                           "senior_management_rating":"senior_management"})

df_rating2

,rating_id,company_ISIN,business_outlook,ceo,compensation_benefits,culture_values,diversity_inclusion,review_number,overall,recommend_friend,senior_management,Company Name
0,1,AEA000801018,0.58,0.50,3.23,3.48,3.82,28,3.39,0.75,3.14,Abu Dhabi Islamic Bank
1,2,AEA002001013,0.67,0.78,3.33,3.33,3.58,13,3.00,0.50,2.58,Aldar Holding
2,3,AEA006101017,0.75,0.50,3.75,3.67,2.67,10,3.30,0.80,3.33,ADCO
3,4,AEA007301012,0.96,0.98,4.11,4.04,4.02,132,4.14,0.88,3.96,ADNOC Group
4,5,AED000201015,0.89,0.75,3.79,3.33,3.54,35,3.60,0.70,3.33,Dubai Islamic Bank
...,...,...,...,...,...,...,...,...,...,...,...,...
2136,2137,ZAE000255360,0.81,0.82,3.40,3.63,4.01,268,3.65,0.72,3.33,Old Mutual
2137,2138,ZAE000255915,0.88,0.82,3.78,3.81,3.85,233,3.94,0.78,3.47,Absa
2138,2139,ZAE000259479,0.71,0.78,3.33,3.87,3.27,17,3.76,0.71,3.20,Pepkor
2139,2140,ZAE000314084,0.85,0.50,3.85,3.91,3.98,71,3.70,0.68,3.23,Outsurance
2140,2141,ZAE000325783,1.00,1.00,5.00,5.00,5.00,1,5.00,1.00,5.00,Naspers

In [158]:
#df_rating2.to_csv(r"C:\Users\rcrds\Downloads\TABLE_RATING.csv",index=False)

In [159]:
def fillU(row):
    if pd.isnull(row["name"]):  # use pd.isnull for single values
        return row["Company Name"]
    else:
        return row["name"]

In [162]:
df_rating2

,rating_id,company_ISIN,business_outlook,ceo,compensation_benefits,culture_values,diversity_inclusion,review_number,overall,recommend_friend,senior_management,Company Name
0,1,AEA000801018,0.58,0.50,3.23,3.48,3.82,28,3.39,0.75,3.14,Abu Dhabi Islamic Bank
1,2,AEA002001013,0.67,0.78,3.33,3.33,3.58,13,3.00,0.50,2.58,Aldar Holding
2,3,AEA006101017,0.75,0.50,3.75,3.67,2.67,10,3.30,0.80,3.33,ADCO
3,4,AEA007301012,0.96,0.98,4.11,4.04,4.02,132,4.14,0.88,3.96,ADNOC Group
4,5,AED000201015,0.89,0.75,3.79,3.33,3.54,35,3.60,0.70,3.33,Dubai Islamic Bank
...,...,...,...,...,...,...,...,...,...,...,...,...
2136,2137,ZAE000255360,0.81,0.82,3.40,3.63,4.01,268,3.65,0.72,3.33,Old Mutual
2137,2138,ZAE000255915,0.88,0.82,3.78,3.81,3.85,233,3.94,0.78,3.47,Absa
2138,2139,ZAE000259479,0.71,0.78,3.33,3.87,3.27,17,3.76,0.71,3.20,Pepkor
2139,2140,ZAE000314084,0.85,0.50,3.85,3.91,3.98,71,3.70,0.68,3.23,Outsurance
2140,2141,ZAE000325783,1.00,1.00,5.00,5.00,5.00,1,5.00,1.00,5.00,Naspers

In [182]:
df_list1 = df_rating2[["company_ISIN","Company Name"]]
df_list1 = df_list1.rename(columns={"company_ISIN":"Company ISIN"})
df_list1

      Company ISIN            Company Name
0     AEA000801018  Abu Dhabi Islamic Bank
1     AEA002001013           Aldar Holding
2     AEA006101017                    ADCO
3     AEA007301012             ADNOC Group
4     AED000201015      Dubai Islamic Bank
...            ...                     ...
2136  ZAE000255360              Old Mutual
2137  ZAE000255915                    Absa
2138  ZAE000259479                  Pepkor
2139  ZAE000314084              Outsurance
2140  ZAE000325783                 Naspers

[2141 rows x 2 columns]

In [183]:
df_list2 = pd.merge(df_company,df_isin, how="left", left_on="name", right_on="Company Name")
df_list2 = df_list2[["Company ISIN","Company Name"]]
df_list2

       Company ISIN                           Company Name
0    ISIN1000000000                      Tecolote Research
1    ISIN1000000001  University of Maryland Medical System
2    ISIN1000000002                                KnowBe4
3    ISIN1000000003                                   PNNL
4    ISIN1000000004                     Affinity Solutions
..              ...                                    ...
737    GB00BN7SWP63                                    GSK
738  ISIN1000000167                             Eventbrite
739  ISIN1000000113         Software Engineering Institute
740  ISIN1000000053                           Numeric, LLC
741  ISIN1000000291           Riverside Research Institute

[742 rows x 2 columns]

In [187]:
list3 = pd.concat([df_list1,df_list2])
list3 = list3.drop_duplicates()
list3

       Company ISIN            Company Name
0      AEA000801018  Abu Dhabi Islamic Bank
1      AEA002001013           Aldar Holding
2      AEA006101017                    ADCO
3      AEA007301012             ADNOC Group
4      AED000201015      Dubai Islamic Bank
..              ...                     ...
686  ISIN1000000316   West Coast University
693  ISIN1000000317                 SkySync
700  ISIN1000000318         DatamanUSA, LLC
716  ISIN1000000319                 23andMe
735  ISIN1000000320               Fivestars

[2462 rows x 2 columns]

In [213]:
df_job2 = pd.merge(df_job,list3,how="left",on="Company Name")
df_job2 = df_job2.rename(columns={"Company Name":"name",
                        "Company ISIN":"company_ISIN"})
df_job2

,job_ID,title,description,location,salary,state,name,company_ISIN
0,0,Data Scientist,"Data ScientistLocation: Albuquerque, NMEducati...","Albuquerque, NM",720,NM,Tecolote Research,ISIN1000000000
1,1,Healthcare Data Scientist,What You Will Do:I. General SummaryThe Healthc...,"Linthicum, MD",875,MD,University of Maryland Medical System,ISIN1000000001
2,2,Data Scientist,"KnowBe4, Inc. is a high growth information sec...","Clearwater, FL",850,FL,KnowBe4,ISIN1000000002
3,3,Data Scientist,*Organization and Job ID**Job ID: 310709Direct...,"Richland, WA",765,WA,PNNL,ISIN1000000003
4,4,Data Scientist,Data ScientistAffinity Solutions / Marketing C...,"New York, NY",1145,NY,Affinity Solutions,ISIN1000000004
...,...,...,...,...,...,...,...,...
737,737,"Sr Scientist, Immuno-Oncology - Oncology",Site Name: USA - Massachusetts - CambridgePost...,"Cambridge, MA",845,MA,GSK,GB00BN7SWP63
738,738,Senior Data Engineer,THE CHALLENGEEventbrite has a world-class data...,"Nashville, TN",1025,TN,Eventbrite,ISIN1000000167
739,739,"Project Scientist - Auton Lab, Robotics Institute",The Auton Lab at Carnegie Mellon University is...,"Pittsburgh, PA",735,PA,Software Engineering Institute,ISIN1000000113
740,740,Data Science Manager,Data Science ManagerResponsibilities:Oversee a...,"Allentown, PA",1275,PA,"Numeric, LLC",ISIN1000000053
741,741,Research Scientist – Security and Privacy,Returning Candidate? Log back in to the Career...,"Beavercreek, OH",935,OH,Riverside Research Institute,ISIN1000000291

In [211]:
df_job2.to_excel(r"C:\Users\rcrds\Downloads\TABLE_JOB_new_new.xlsx",index=False)

In [189]:
df_company

,headquarters,size,year_founded,ownership_type,industry,sector,revenue,name
0,"Goleta, CA",501 to 1000 employees,1973,Company - Private,Aerospace & Defense,Aerospace & Defense,$50 to $100 million (USD),Tecolote Research
1,"Baltimore, MD",10000+ employees,1984,Other Organization,Health Care Services & Hospitals,Health Care,$2 to $5 billion (USD),University of Maryland Medical System
2,"Clearwater, FL",501 to 1000 employees,2010,Company - Private,Security Services,Business Services,$100 to $500 million (USD),KnowBe4
3,"Richland, WA",1001 to 5000 employees,1965,Government,Energy,"Oil, Gas, Energy & Utilities",$500 million to $1 billion (USD),PNNL
4,"New York, NY",51 to 200 employees,1998,Company - Private,Advertising & Marketing,Business Services,Unknown / Non-Applicable,Affinity Solutions
...,...,...,...,...,...,...,...,...
737,"Brentford, United Kingdom",10000+ employees,1830,Company - Public,Biotech & Pharmaceuticals,Biotech & Pharmaceuticals,$10+ billion (USD),GSK
738,"San Francisco, CA",1001 to 5000 employees,2006,Company - Public,Internet,Information Technology,$100 to $500 million (USD),Eventbrite
739,"Pittsburgh, PA",501 to 1000 employees,1984,College / University,Colleges & Universities,Education,Unknown / Non-Applicable,Software Engineering Institute
740,"Chadds Ford, PA",1 to 50 employees,-1,Company - Private,Staffing & Outsourcing,Business Services,$5 to $10 million (USD),"Numeric, LLC"
741,"Arlington, VA",501 to 1000 employees,1967,Nonprofit Organization,Federal Agencies,Government,$50 to $100 million (USD),Riverside Research Institute

In [218]:
df_company2 = pd.merge(list3,df_company,how="left",left_on="Company Name",right_on="name")#.drop(columns=["rating_id","business_outlook","ceo","compensation_benefits","culture_values","diversity_inclusion","review_number","overall","recommend_friend","senior_management"]df_company2)
df_company2 = df_company2.drop_duplicates().drop(columns=["name"]).rename(columns={"Company ISIN":"company_ISIN",
                                                                                   "Company Name":"name"})
df_company2["year_founded"] = df_company2["year_founded"].fillna(0).astype(int)
df_company2 = df_company2.fillna("Unknown")
df_company2.drop_duplicates()

,company_ISIN,name,headquarters,size,year_founded,ownership_type,industry,sector,revenue
0,AEA000801018,Abu Dhabi Islamic Bank,Unknown,Unknown,0,Unknown,Unknown,Unknown,Unknown
1,AEA002001013,Aldar Holding,Unknown,Unknown,0,Unknown,Unknown,Unknown,Unknown
2,AEA006101017,ADCO,Unknown,Unknown,0,Unknown,Unknown,Unknown,Unknown
3,AEA007301012,ADNOC Group,Unknown,Unknown,0,Unknown,Unknown,Unknown,Unknown
4,AED000201015,Dubai Islamic Bank,Unknown,Unknown,0,Unknown,Unknown,Unknown,Unknown
...,...,...,...,...,...,...,...,...,...
2856,ISIN1000000316,West Coast University,"Irvine, CA",10000+ employees,1997,Company - Private,Colleges & Universities,Education,Unknown / Non-Applicable
2857,ISIN1000000317,SkySync,"Ann Arbor, MI",51 to 200 employees,2011,Company - Private,Computer Hardware & Software,Information Technology,Unknown / Non-Applicable
2858,ISIN1000000318,"DatamanUSA, LLC","Centennial, CO",51 to 200 employees,-1,Company - Private,IT Services,Information Technology,$5 to $10 million (USD)
2859,ISIN1000000319,23andMe,"Sunnyvale, CA",501 to 1000 employees,2006,Company - Private,Biotech & Pharmaceuticals,Biotech & Pharmaceuticals,Unknown / Non-Applicable
2860,ISIN1000000320,Fivestars,"San Francisco, CA",201 to 500 employees,2011,Company - Private,Internet,Information Technology,$100 to $500 million (USD)

In [217]:
df_company2.to_csv(r"C:\Users\rcrds\Downloads\TABLE_COMPANY4.csv",index=False)

In [165]:

df_company2["name"]=df_company2.apply(fillU, axis=1)
df_company2 = df_company2.drop(columns="Company Name")
df_company2["year_founded"] = df_company2["year_founded"].fillna(0)
df_company2 = df_company2.fillna("Unknown")
df_company2["year_founded"] = df_company2["year_founded"].astype(int)

df_company2["name"] = df_company2["name"].fillna("").astype(str).str.strip().str.upper()
df_company2 = df_company2.drop_duplicates(subset="name", keep="first")
df_company2

,headquarters,size,year_founded,ownership_type,industry,sector,revenue,name,company_ISIN
0,"Carle Place, NY",1001 to 5000 employees,1976,Company - Public,Wholesale,Business Services,$1 to $2 billion (USD),"1-800-FLOWERS.COM, INC.",Unknown
1,"Saint Louis, MO",51 to 200 employees,2016,Company - Private,IT Services,Information Technology,Unknown / Non-Applicable,1904LABS,Unknown
3,Unknown,Unknown,0,Unknown,Unknown,Unknown,Unknown,1ST SOLAR,US3364331070
4,"Sunnyvale, CA",501 to 1000 employees,2006,Company - Private,Biotech & Pharmaceuticals,Biotech & Pharmaceuticals,Unknown / Non-Applicable,23ANDME,Unknown
5,Unknown,Unknown,0,Unknown,Unknown,Unknown,Unknown,37 INTERACTIVE,CNE1000010N2
...,...,...,...,...,...,...,...,...,...
2805,Unknown,Unknown,0,Unknown,Unknown,Unknown,Unknown,MONDAY.COM,IL0011762130
2806,Unknown,Unknown,0,Unknown,Unknown,Unknown,Unknown,UPL ENVIROMENTAL ENGINEERS,INE628A01036
2807,"Harrisburg, PA",201 to 500 employees,1997,Company - Private,Advertising & Marketing,Business Services,$25 to $50 million (USD),WEBFX.COM,Unknown
2808,Unknown,Unknown,0,Unknown,Unknown,Unknown,Unknown,ØRSTED,DK0060094928
2809,Unknown,Unknown,0,Unknown,Unknown,Unknown,Unknown,UNKNOWN,AEE000301011

In [ ]:
df_company3 = pd.merge(df_company2,df_isin,how="left",left_on="name",right_on="Company Name")
df_company3 = df_company3.drop(df_company3.index[-1]).drop(columns="Company Name")
df_company3 = df_company3.rename(columns={"Company ISIN":"ISIN"})
df_company3
#df_company3.to_csv(r"C:\Users\rcrds\Downloads\TABLE_COMPANY.csv",index=False)